Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.GetValueAsFloats
Get the value property as floats.

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.GetValueAsDoubles
Get the value property as doubles.